art_share/app/controllers/artworks_controller.rb

    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            render json: user.artworks + user.shared_artworks
        else
            render json: Artwork.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"