art_share/app/controllers/comments_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            render json: artwork.comments
        elsif params[:user_id]
            author = User.find(params[:user_id])
            render json: author.comments
        else
            render json: Comment.all

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "what an awesome piece of work"], ["author_id", 2], ["artwork_id", 9], ["created_at", "2019-10-31 20:25:16.791577"], ["updated_at", "2019-10-31 20:25:16.791577"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save