art_share/app/controllers/users_controller.rb

    def index
        all_users = User.all

        if params[:user_id]
            user = all_users.find(params[:user_id])
            render json: user
        elsif params[:username]
            user = all_users.where('username LIKE ?', '%' + params[:username] + '%')
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (username = '%#{params[:username]}%')

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-10-31 20:36:58.933929"], ["updated_at", "2019-10-31 20:36:58.933929"], ["username", "user_9"]]